<template>
  <div class="message-box">
    <p v-html="formatDescription(selectedMessage)"></p>
    <ul class="game-list">
      <li class="game-item" v-for="(game, index) in games" :key="index" @click="selectGame(game)">
        <a :class="{ 'selected': selectedGame === game }">{{ game }}</a>
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  data() {
    return {
      games: ['개요', '역사', '종류', '특징'],
      selectedGame: '개요'
    };
  },
  computed: {
    selectedMessage() {
      // <img src="image-url.jpg" alt="Image"> <br>사용 가능
      if (this.selectedGame === '개요') {
        return '1인칭 슈팅게임(First Person Shooter)<br><br>3차원의 공간을 게임상의 캐릭터의 시점으로 누비며 적을 총과 같은 발사무기로 공격하는 게임 장르. 철저하게 플레이어의 시점을 기준으로 진행되기에 팔과 손(가끔 발이나 다리)을 제외한 다른 신체는 볼 수 없다. 이와 달리 제 3자의 시점으로 자신의 캐릭터를 볼 수 있는 게임은 3인칭 슈팅 게임(Third Person Shooter)으로 분류된다. TPS란 용어 자체가 FPS가 나온 이후 기존에 있던 게임 장르를 구별하기 위해 만들어진 단어다. TPS의 기원을 FPS에서 찾기는 무리가 있으나, TPS는 FPS의 조작이나 액션에 큰 영향을 받은 것이 사실이기에 플레이하는 감각이 유사한 경우가 많다.<br><br>FPS 게임에서 플레이어는 주로 사람을 조종하며, 멕워리어나 비행 시뮬레이션처럼 탈것 안에서 진행하는 게임은 대개 FPS로 분류되지 않는다. 또한 위저드리 시리즈, 마이트 앤 매직 시리즈처럼 1인칭 시점으로 진행되지만 슈팅 요소가 거의 혹은 전혀 등장하지 않는 게임은 FPS로 분류되지 않는다. 버추어 캅, 더 하우스 오브 더 데드와 같은 자동으로 이동하며 화면 안의 목표물을 향해 사격하는 건슈팅 게임도 FPS와는 별개의 장르로 분류된다. 건슈팅 게임은 영미권에서 레일 슈터(Rail Shooter)[3]란 명칭으로 통한다.[4] 과거에는 사격과 탐험에 중점을 둔 순수한 형태의 FPS 게임들이 대부분이었으나 오늘날에는 1인칭 시점과 무언가를 쏜다는 특징을 유지한 채 타 장르의 특성이 접목된 복합장르 형태의 게임도 많이 나오고 있다.<br><br>FPS(Frames Per Second)와 엮어서, 초당 프레임 수가 높을수록 우위를 점하는 장르이기도 하다. 60Hz와 144Hz의 차이는 크며 또한 높은 프레임을 뽑기 위해서는 고사양의 컴퓨터가 요구되고 이는 곧 컴퓨터 업그레이드의 주 목적이 된다. 덧붙여서 마우스나 키보드 등 제대로 장비를 갖추고자 하면 돈이 엄청나게 깨진다. 물론 프로가 되고 싶은 것이 아니고, 단지 게임을 즐기는것만이 목적이라면 장비에 너무 연연하지 않아도 된다. 애초에 최적화 이슈가 많은 게임의 경우 프로게이머들도 저사양 모드로 낮추고 플레이하는 경우가 많다.<br><br><br>';
      } else if (this.selectedGame === '역사') {
        return '1인칭 시점을 세계 최초로 도입한 게임은 1974년에 PLATO라는 컴퓨터 플랫폼으로 나온 Spasim 혹은 Imlac PDS-1 컴퓨터 플랫폼으로 나온 Maze War다. 특히 Spasim은 아예 비디오 게임계에서 콕핏뷰 자체를 최초로 정의한 게임이라는데에 의의가 있다. 또한 1979년에 나온 아칼라베스: 파멸의 세계나 1980년대 초에 나온 RPG 울티마 1~울티마 3에서 던전 진행을 간단한 선으로 표현된 1인칭 시점으로 구현한 바 있고, 이후 1인칭 시점은 위저드리 같은 던전 탐험형 RPG에서 주로 쓰였다. 물론 초창기 PC 사양으로는 타일 기반의 맵에 90도 회전의 딱딱한 이동 방식밖에 표현이 불가능했지만, 명백히 1인칭 시점으로 진행되었다. 또한 한 때 PC 게임의 인기 장르였던 비행 시뮬레이션 게임의 콕핏뷰도 1인칭 시점이다. 또한 1인칭 시점의 총쏘는 게임도 90년대 이전에 이미 시도되었던 바 있다. 1982년의 Dungeons of Daggorath의 경우는 여러 단계의 던젼 디자인에 소리를 이용해 몬스터의 위치를 알아내는 메커니즘을 도입한 최초의 게임이었다.<br><br>다만 FPS 장르가 본격적으로 시작된 계기는 1992년에 나온 울펜슈타인 3D가 맞다. 사실 전작인 카타콤 3D도 울펜슈타인과 비슷한 배경에 상당수 FPS게임 토대를 더더욱 세웠던 게임[5]이었고 그보다 먼저 나온 호버탱크 3D도 FPS게임 토대가 되었지만 이들 게임에서 여러 부족한 점을 채워 발전된 울펜슈타인이 FPS게임 첫 토대로서 가장 흥행을 거두면서 이 장르를 알리게 된다. 종전에 나오던 패미컴의 오리사냥 등과는 달리 울펜슈타인 3D는 FPS 장르의 클리셰를 확립시킨 점에서 그 중요성이 남다르다.<br><br>울펜슈타인 3D는 기존 게임보다 더 빠르고 부드럽게 구동되면서 시야를 1인칭으로 제한하는 긴박한 액션으로 게이머들에게 어필하였고, 곧이어 어포지, 번지 등의 개발사들이 파생작을 내놓으면서 FPS 장르가 형성된다. 특히 1993년에 발매된 둠이 크게 히트하면서 FPS라는 장르의 정체성이 확고하게 자리잡았고, 더욱 많은 개발사들이 FPS 개발에 뛰어들면서 장르 발전이 가속화되었다. 이때까지만 해도 아류작이 별로 없었기에, 보통 둠과 비슷한 시기에 나온 다른 FPS들은 \'둠 클론\'이라는 대명사로도 불렸으나, 이후 FPS라는 장르명칭이 90년대 말부터 서서히 정립되기 시작한다.<br><br>이어 네트워크의 발전과 3D 혁명이 불어닥친 1995년 이후에 FPS 장르의 발전 방향은 몇 가지로 요약되는데, 1996년 6월 퀘이크부터 시작된 풀3D 폴리곤 기반 그래픽 기술의 적극적인 도입,[6] 배경 및 레벨과 플레이어의 상호작용,[7] 멀티플레이의 발전,[8][9] 1997년 이후 게임 플랫폼이 DOS 기반에서 Windows 기반으로 전환되면서 그래픽 가속 장치를 이용한 기술적인 발전이 무엇인지 보여준 퀘이크 2, 1998년 6월 그래픽 가속 장치 없어도 어느 정도 퀄리티를 뽑을 수 있는 수준으로 도달한 언리얼 등 시스템적 요소는 물론 기술적으로도 함께 발전했었다. PC용 FPS의 조작방식(마우스 시점 조종 및 WASD 이동)이 확립된 것이 그 때이다.<br><br>퀘이크 시리즈, 골든 아이, 레인보우 식스 시리즈, 언리얼 시리즈 등이 이 시기의 대표작들이며, 각각의 게임의 항목에서 보듯이 오늘날의 FPS에서는 당연히 있는 것으로 여겨지는 요소들을 개척한 선구자들이다. 그리고 오늘날의 FPS가 한국에서 인기를 얻기 시작한 것도 이 시점이었다.<br><br>21세기에 들어서의 FPS는 MMORPG처럼 코옵 플레이 방식, 샌드박스 요소처럼 다양한 볼거리 및 즐길거리, 소재의 다양성 및 적극적인 내러티브 요소의 도입으로 FPS 게임의 발전 방향이 다양[10]해졌지만, 레벨 디자인에서의 발전은 거의 정체되어 있는 편이다. 그 중 첫 번째는 스토리성의 극적인 강화로 나온 FPS 게임으로, 이를 ""First Person Theater""라고까지 불리며 하프-라이프로부터 이어진 스토리성을 강화하고 그래픽을 보강하는 측면으로만 개발 초점이 맞춰졌다. 이는 콜 오브 듀티 시리즈나 바이오쇼크 시리즈가 성공하는데 발판을 마련했다고 볼 수 있다. 대개 싱글플레이에서 높은 몰입감의 일등공신으로 여겨졌지만, 한편으로는 스토리텔링을 위해 자유로운 던전 탐험이 주를 이뤘던 이동의 자유를 제약시키는 원인 제공을 하기도 하였다.[11] 두 번째로, 동유럽 제작사에서 개발된 스토커 시리즈도 있는데 이전부터 FPS에 RPG의 요소를 차용하거나, 또는 RPG에서 FPS의 액션성을 차용하려는 노력이 있었으나 접점을 이룩하지는 못하였다. 그러한 측면에서 스토리성을 기본으로 하는 현대 FPS를 베이스로, 이동의 자유와 RPG 요소를 적극적으로 도입한 스토커 시리즈는 특별한 개성이 있다고 볼 수 있다. 세 번째로, 선형적인 진행을 탈피하기 위해 샌드박스 요소를 이용하여 자유도를 높이고 즐길거리를 늘린 파 크라이 시리즈나 크라이시스 시리즈 같은 FPS 게임들이 많이 등장했다. 그 중에서도 크라이시스는 3D 게임 그래픽계의 혁신을 불러온 게임으로 실사스러운 그래픽 때문에 \'크라이실사스\'라는 별명까지 붙여지기도 했다.[12] 네 번째로, 다른 유저들과 같은 공간에서 플레이하는 멀티플레이 요소를 강화시킨 FPS 게임들이 있는데 대표적으로 배틀필드 시리즈가 있으며, 통신 속도의 향상으로 나타난 인터넷의 발달로 인해 사람들과의 커뮤니케이션이 활발해지다보니 멀티플레이 요소의 중요성이 점점 커지고 있다. 이러한 외적인 요인 덕분에 현재 전체 FPS 게임의 대표 주자로 자리잡고 있다. 플래닛사이드 2에서 이런 요소의 정점을 찍었는데, 타 FPS들이 방을 만들어 제한된 숫자끼리 싸우는 것과 달리 MMOFPS를 표방하며 드넓은 네 개의 대륙 위에서 수많은 유저가 세 세력으로 나뉘어 끝없는 점령전을 펼치는 전쟁을 구현했다.<br><br>FPS 장르는 RTS와는 달리 콘솔에서도 큰 성공을 거두었다. 1990년대의 FPS는 주로 PC 위주로 인기를 얻었으나, 5세대 콘솔에서 닌텐도 64의 튜록과 골든 아이 007, 플레이스테이션의 메달 오브 아너 시리즈 가 성공을 거두었다. 그리고 2001년에 엑스박스와 함께 발매된 헤일로가 콘솔 FPS의 여러 표준을 제시하고 북미에서 대박을 터트리면서 일본을 제외한 콘솔 시장에서 손꼽히는 인기 장르가 된다. 그리하여 FPS 장르는 엑스박스 360과 플레이스테이션 3의 발매를 기점으로 콘솔 시장 위주로 재편되었으며, 2007년 11월에 발매된 콜 오브 듀티 4: 모던 워페어가 메가히트하면서 게임업계에서 가장 인기있는 장르가 되었다. 하프-라이프로부터 시작된 현대 FPS의 특성은 콘솔 FPS에서 증폭되었으며, 현대 FPS의 주류는 콘솔 FPS가 되고 있다.<br><br>휴대용 콘솔에서는 아무래도 가정용보다는 표현이 뒤떨어지고 조작버튼도 많지 않은 편이다보니 발전이 굉장히 더뎠던 편. 게임보이 어드밴스로 들어와서야 둠 시리즈, 울펜슈타인 3D 등이 이식되었으며, 해당 게임들과 비슷한 시기 주로 사용되었던 스프라이트 기반의 2.5D 그래픽으로 제작된 FPS 게임들을 시작으로 휴대용 콘솔에서도 FPS가 본격적으로 제작되기 시작한다. 다만 거치형 콘솔과 달리 FPS 게임이 나오는 빈도는 확실히 적다. 2017년 발매된 닌텐도 스위치는 성능 문제에서 다소 해소되어, 둠이라던가, 울펜슈타인 2: 더 뉴 콜로서스라던가, 메트로: 라스트 라이트 같은 콘솔 FPS가 제법 이식되는 편이다.<br><br><br>';
      } else if (this.selectedGame === '종류') {
        return 'FPS 분류에도 하위분류가 무수히 존재하며, 각각 아우르는 범위가 조금씩 차이난다. 또한, 시대가 지남에 따라 분류하는 기준이 달라지고 범주가 많이 달라지기에 이를 감안하고 이해할 필요가 있다. 일부 내용은 위키백과를 참고하였다.<br><br>고전 FPS<br>대표작: 둠, 듀크 뉴켐 3D, 퀘이크, 언리얼FPS 장르가 대중화된 시기인 90년대 초중반의 게임 스타일을 지칭하는 용어. 한국과 영미권에서 모두 흔하게 사용하는 명칭이다. 영미권에서는 고전 스타일을 뜻하는 classic, old-school 뒤에 shooter 또는 FPS를 붙여 부른다. 구글 검색결과에 따르면 포괄적이면서 오해의 소지가 비교적 적다.1990년대 초중반에는 대부분의 FPS 게임이 둠과 퀘이크 스타일인데다 FPS라는 장르명조차 보급되지 않았기에 고전 FPS란 명칭은 존재하지 않았고 대신 둠 클론(Doom clone), 퀘이크-라이크(Quake-like) 같은 명칭이 사용되었다. 자세한 내용은 고전 FPS 문서 참고.<br><br>아레나 FPS<br>대표작: 퀘이크 3 아레나, 언리얼 토너먼트<br>주로 고전 FPS 스타일의 멀티플레이를 지칭한다. 역시 2000년대 이후에 생겨난 명칭이다. 해외에서도 Arena FPS로 부르며 AFPS로 줄여 쓰기도 한다. 투기장(arena) 스타일의 맵 디자인 또는 이런 스타일의 대표작인 퀘이크 3 아레나로부터 비롯된 것으로 추정된다.<br><br>레트로 FPS<br>대표작: 더스크, 울트라킬<br>보통 현대의 게임이지만 90년대 고전 FPS 스타일을 의식적으로 모방한 게임을 말한다. 특히 스프라이트를 활용한 2.5D 그래픽이나 초기 3D 그래픽 등을 흉내낸 게임을 지칭한다. Boomer Shooter 라는 별칭으로도 불린다.<br><br>하이퍼 FPS<br>대표작: Apex, 오버워치, 발로란트<br>한국에서만 사용하는 명칭으로 비현실적이거나 속도가 빠른 FPS를 뜻한다.[23] 고전 FPS의 콩글리쉬에 가깝지만 그보다는 지칭하는 범위가 넓다. 고전 FPS의 게임플레이 특징을 갖추지 않은 게임도 SF 배경이나 비현실적인 요소를 갖추기만 했다면 하이퍼 FPS로 지칭하는 경우가 많다.오버워치를 통해 널리 퍼지긴 했으나 그 이전에도 간간히 사용되곤 했다. 구글에서 하이퍼 FPS란 장르명이 최초로 사용된 용례는 2006년 무렵개발 중이던 헉슬리의 개발자 인터뷰다. # 헉슬리는 FPS와 MMORPG 게임플레이의 결합을 시도했고 제작진은 이전에 없던 종류의 FPS 게임을 홍보하기 위한 일종의 마케팅 용어로 해당 장르명을 사용한 것으로 보인다<br><br>클래식 FPS<br>대표작: 카운터 스트라이크 시리즈,레인보우 식스 시즈, 발로란트, 서든어택, VEILED EXPERTS[24]<br>기존 FPS 게임의 클래식 모드인 폭파 미션, 인질 구출 등등 게임모드를 메인 모드로 하는 FPS 게임을 뜻한다.<br><br>호러 FPS<br>대표작: 바이오하자드 7 레지던트 이블, 바이오하자드 빌리지, 크라이 오브 피어, F.E.A.R. 시리즈, GTFO, 헌트 쇼다운, 클라이브 바커의 언다잉, S.T.A.L.K.E.R 시리즈<br>호러 요소를 넣은 FPS를 뜻한다. 사실 영미권에서 좀비 코옵 FPS도 호러 FPS로 분류하는 경우가 있다. 특징으로는 게임 플레이 도중 점프 스케어가 있는 편이다. 때문에 여기에 속하는 게임들 대다수는 1인칭 생존 호러로 분류되기도 한다.<br><br><br>';
      } else if (this.selectedGame === '특징') {
        return 'FPS는 플레이어가 주인공 시점에서 가상의 세계를 탐험한다는 점에서 가상현실에 가장 가까운 형태의 장르이며, 이 때문에 많은 작품들이 뛰어난 그래픽을 갖추고 비디오 게임의 3D 기술을 선도하고 있다. 또한 같은 이유로 여타 장르와 결합되어 그 장르의 핵심적인 이점은 유지한 채 더 몰입감있는 경험을 제공하는 경우도 많다. 장르 초창기에는 원초적인 전투와 맵의 탐험에 중점을 맞춘 고전 FPS가 주류였지만, 하프-라이프가 가져다 준 충격이 있었던 1990년대 후반을 거치면서 FPS 장르는 더욱 사실적이며 복잡한 게임 메커니즘을 갖추고 전략성을 요구하는 택티컬 슈터[32]와 하프-라이프와 콜 오브 듀티 시리즈를 위시한 연출과 내러티브가 강조된 게임들로 분화 및 발전되었으며, 2000년대에 들어서는 팀 기반 멀티플레이 게임들과 수백, 수천 명의 게이머들이 접속하여 싸우는 MMOFPS 장르 등으로 더욱 세분화되었다. 가장 대표적인거의 유일한 것이 플래닛사이드 2. 하지만 7세대 콘솔에 접어들면서 가파른 게임 제작비 증가와 게임패드 중심의 조작이 일반화되면서 장르의 실험적인 면은 많이 축소되고 있는 형국이다.<br><br>1인칭 시점으로 무언가(주로 총기)를 들고 목표물(주로 사람)을 향해 무언가(주로 탄환)를 쏜다는 것이 게임플레이의 핵심이 되기 때문에 과격한 표현이 많아 게임의 폭력성을 논할 때 빠지지 않고 늘 언급되는 장르이기도 하다. 따라서 대부분의 FPS 게임은 보통 청소년 이용불가 등급을 받고 출시되는 경우가 많다. 보수적인 언론 및 여론에 의해 총기난사 등의 폭력사건의 원인으로 자주 언급되기도 한다. 한국 보수언론에서는 FPS 게임이 총싸움 게임, 미국의 보수언론에서는 살인 시뮬레이션이라고 다소 부정적인 어감으로 부르는 경우가 많다. 심한 경우에는 FPS 게이머들을 싸잡아서 정신적으로 문제가 있는 사람들, 잠재적 총기난사범으로 몰아가는 경우도 있다.<br><br>1인칭 시점으로 진행하다보니 NPC는 몰라도 플레이어 캐릭터(주인공)의 3D 모델 자체에는 신경을 덜 쓰기도 한다. 현세대로 온다고 해도 팔 외에는 딱히 보여줄 게 없다보니 생략하는 듯 하다. 시점을 아래로 돌렸는데 다리가 없거나, 주인공의 그림자가 없는 등, 일부에서는 다리가 있으면 아래를 바라볼 때 오히려 방해된다고 하는 의견도 있다. 이 점이 두드러지는 게 콜 오브 듀티인데 모던 워페어 2까지만 해도 조종하는 캐릭터의 머리와 몸통이 실제로는 없었다.(...) 팔만 둥둥 떠다니는 상황. 블랙 옵스부터는 몸통이 갖추어지기는 했지만 사실 블랙 옵스 때에도 머리는 없는 상태였다. 다만 예외적으로 월드앳워 같은 작품은 특정 씬을 제외하면 주인공 모델링이 구현되어 있었다. 대체로 헤일로 시리즈,(2편부터 플레이어의 다리를 볼 수 있다.) 크라이시스, F.E.A.R., 배틀필드 시리즈, 미러스 엣지, ARMA 등은 주인공이 시점을 아래로 내리면 다리가 보이며 주인공의 그림자도 표현된다.[33] 그러나 이것도 어디까지나 싱글플레이에 한정된 이야기이다. 멀티플레이에서는 콜 오브 듀티 시리즈건 배틀필드 시리즈건 머리 몸통 다 모델링이 되어있다. 상호 모습이 보이는 멀티플레이에서 팔만 둥둥 떠다닌다면 엄청난 문제가 될 테니까. 싱글플레이에서 주인공 모델링이 안 된 것은 충분히 모델링할 수 있지만 시스템 자원을 최대한 절약하기 위함이다. 그래서 우스갯소리로 First Person Shooter(1인칭 슈팅 게임)이 아니라 Footless Person Shooter(발없는 사람 슈팅 게임)이라 부르기도 한다.(...)<br><br>e스포츠 게임 중에서는 다른 게임들보다도 장비빨, 즉 하드웨어 성능이 특히 중요하게 작용하는 편이다. 컴퓨터 사양과 네트워크 상태는 물론이고 에임의 핵심인 마우스와 마우스패드, 무빙 수단인 키보드, 반응속도를 좌우하는 모니터, 정교한 사운드플레이를 위한 헤드셋or스피커 등 게이밍 기어의 수요가 매우 높은 장르이기도 하다. 최신 FPS 게임을 최상의 환경에서 즐기기 위해 작정하고 세팅한다고 가정하면 수백만원은 우습게 깨지기 때문에 RPG가 게임 내적으로 돈이 든다면 FPS 게임은 게임 외적으로 돈이 많이 드는 장르이다.<br><br>무기는 기존에는 여러개의 무기를 들고 키보드 숫자키로 바꾸는 게 대세였지만, 헤일로로 인해서 무기 2개 들고다니기가 유행했다. 그 후 콘솔로도 내기 위해 이것을 차용하는 경우가 많다. 보통 주무기, 보조무기, 근접무기 이 3가지로 나뉘며, 가끔 수류탄이나 조준기, 지뢰, 포탑 등 특수무기가 존재하기도 한다.<br><br>대체로 울펜슈타인 3D를 시작으로 FPS가 확립되고 둠이 FPS의 아버지 격이며(근접공격 기능, 무기의 컨셉 등), 그 후 여러 FPS 게임이 나오면서 많은 패러다임을 일으키고 컨셉을 확실히 하였다. 듀크 뉴켐 3D에선 점프 기능이 본격적으로 퍼지며[34] 더 3차원적인 진행이 가능해졌고, 퀘이크 2는 그동안의 정중앙 고정 크로스헤어가 아니라 마우스로 시점을 자유자재로 돌리며 조준하는 기능이 퍼졌다. 큰 반향을 일으킨 하프라이프는 WASD 방향키 이동을 고정시켰고 NPC 아군 및 NPC와의 대화 기능, 높은 인공지능, 플래시라이트, 재장전[35]을 도입해 더욱 박진감 넘치는 진행을 유도했다. 언리얼 시리즈는 높은 인공지능을 더욱 극대화하였고, 헤일로: 전쟁의 서막은 체력 자동회복,[36] 무기 소지량 2개, 근접무기와 수류탄 고정키 할당, 다양한 탑승물 도입이라는 큰 변화를 이끌었다. 그 후 콜 오브 듀티는 정조준 기능, 일직선형 드라마틱 연출 이라는 개념을 퍼뜨렸다. 이렇게 해서 2000년대 초반에 우리가 아는 FPS의 필수요소들이 확립되었고, 최근에 나오는 FPS들도 저 요소에서 크게 벗어나지 않는다. 고전 FPS들도 후배격 게임들의 요소를 많이 도입할 정도이다.<br><br><br>';
      } else {
        return '';
      }
    }
  },
  methods: {
    selectGame(game) {
      this.selectedGame = game;
    },
    formatDescription(description) {
      return description.replace(/\n/g, '<br>');
    }
  }
};
</script>

<style scoped>
.message-box {
  display: inline-block;
  border: 3px solid #4c339e;
  border-radius: 10px;
  margin-top: 100px; /* Adjust the value to move the message box downward */
  text-align: left;
  padding: 0;
  margin: 0.6cm;
  max-width: 600px; /* Adjust the maximum width as needed */
  box-sizing: border-box; /* Ensure the border width is included in the width calculation */
  overflow: auto; /* Hide any content that exceeds the maximum width */
  white-space: normal; /* Allow line breaks within the message box */
}

.message-box p {
  font-size: 1.2em;
  color: #93bee9;
  margin: 0;
  text-align: left;
  padding: 0;
}

.game-list {
  list-style-type: none;
  padding: 0;
  position: absolute;
  top: 162px;
  left: 60px;
  padding-left: 20px;
}

.game-item {
  padding: 10px;
  margin-bottom: 40px;
  border: 1px solid #4c339e;
  border-radius: 10px;
  font-size: 0.5cm;
}

.game-item a {
  text-decoration: none;
  color: #538eca;
  cursor: pointer;
}

.game-item a.selected {
  color: #2fc260;
}

</style>
